In [888]:
import pandas as pd
import numpy as np
file_to_load = "Resources/purchase_data.csv"
purchase_data = pd.read_csv(file_to_load)

In [889]:
average_price = purchase_data.groupby(["Item Name"])
average_price["Item Name"].unique()
Total_Unique_Items = len(average_price["Item Name"].unique())
Average_Purchase_Price = purchase_data["Price"].mean()
Total_Revenue = purchase_data["Price"].sum()
Total_Purchases = purchase_data["Purchase ID"].count()

In [890]:
Total_Players = len(purchase_data["SN"].value_counts())
Total_Players

576

In [891]:
Total_Players_Summary = pd.DataFrame({"Total Players":[Total_Players]})
Total_Players_Summary.set_index("Total Players")

Empty DataFrame
Columns: []
Index: [576]

In [892]:
Purchasing_Analysis = pd.DataFrame({"Total Unique Items": [Total_Unique_Items], "Average Purchase Price": [Average_Purchase_Price],
                                    "Total Number of Purchases": [Total_Purchases], "Total Revenue": [Total_Revenue]})
Purchasing_Analysis

,Total Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.050987,780,2379.77

In [893]:
Gender = purchase_data.groupby(["Gender"])["SN"].value_counts()
Male = len(Gender["Male"]) 
Female = len(Gender["Female"])
Other = len(Gender["Other / Non-Disclosed"])

In [894]:
Male_P = (Male / Total_Players)
Female_P = (Female / Total_Players) 
Other_P = (Other / Total_Players)

In [895]:
Male_P = "{:.0%}".format(Male_P)
Female_P = "{:.0%}".format(Female_P)
Other_P = "{:.0%}".format(Other_P)

In [896]:
Gender_Demographics = pd.DataFrame({"Gender": ["Male", "Female", "Other / Non-Disclosed"], "Total Count": [Male, Female, Other], "Percentage of Players": [Male_P, Female_P, Other_P]})
Gender_Demographics.set_index(["Gender"])

                       Total Count Percentage of Players
Gender
Male                           484                   84%
Female                          81                   14%
Other / Non-Disclosed           11                    2%

In [897]:
gender = purchase_data.groupby("Gender")

In [898]:
gender_avg = gender.mean()

In [899]:
Average_Price_Gender = gender_avg["Price"]

In [900]:
Average_Price_Gender = Average_Price_Gender.map("${:.2f}".format)

In [901]:
gender_total = gender["Price"].sum()
gender_total = gender_total.map("${:.2f}".format)

In [902]:
SN = (purchase_data.groupby(["SN","Gender"], as_index=False)["Price"].sum().groupby("Gender")["Price"].mean())
SN = SN.map("${:.2f}".format)

In [903]:
Purchasing_Analysis_Gender = pd.DataFrame({"Gender": ["Male", "Female", "Other / Non-Disclosed"],
                                            "Purchase Count": [Male, Female, Other],
                                           "Average Purchase Price": Average_Price_Gender,
                                            "Total Purchase Value": gender_total, "Avg Total Purchase per Person": SN})
Purchasing_Analysis_Gender.set_index(["Gender"])

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Male,484,$3.20,$361.94,$4.47
Female,81,$3.02,$1967.64,$4.07
Other / Non-Disclosed,11,$3.35,$50.19,$4.56

In [904]:
bins = [0, 9.9, 13.9, 18.9, 24.9, 28.9, 33.9, 38.9, 100]
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [905]:
Ages = purchase_data 
Ages["Age Ranges"] = pd.cut(purchase_data["Age"], bins=bins, labels=group_labels, right=False)
Ages.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [906]:
Ages1 =Ages.groupby("Age Ranges")
Ages1["Age Ranges"].count()

Age Ranges
<10       23
10-14     26
15-19    115
20-24    388
25-29     88
30-34     77
35-39     44
40+       19
Name: Age Ranges, dtype: int64

In [907]:
Age_Demographics = pd.DataFrame({"Total Count": Ages1["Age Ranges"].count(), "Precentage of Players": (Ages1["Age Ranges"].count() / 780) * 100})
Age_Demographics

            Total Count  Precentage of Players
Age Ranges
<10                  23               2.948718
10-14                26               3.333333
15-19               115              14.743590
20-24               388              49.743590
25-29                88              11.282051
30-34                77               9.871795
35-39                44               5.641026
40+                  19               2.435897

In [908]:
total_spending = purchase_data
spending = purchase_data

In [909]:
spending = purchase_data.groupby(["SN"], as_index=False)["Price"].sum()

In [910]:
PD = purchase_data.groupby(["SN"])["Item Name"].agg(["count"])

In [911]:
total_spending = spending
total_spending = pd.merge(total_spending, PD, on="SN", how="outer")
total_spending.head()

             SN  Price  count
0  Adairialis76   2.28      1
1   Adastirin33   4.48      1
2        Aeda94   4.91      1
3        Aela59   4.32      1
4     Aelaria33   1.79      1

In [912]:
total_spending["Average Purchase Price"] = total_spending["Price"] / total_spending["count"]
total_spending = total_spending.sort_values(["Price"], ascending=False)
total_spending = total_spending.rename(index = str, columns={"Price": "Total Purchase Value", "count": "Purchase Count"})
total_spending["Total Purchase Value"] = total_spending["Total Purchase Value"].map("${:,.2f}".format)
total_spending["Average Purchase Price"] = total_spending["Average Purchase Price"].map("${:,.2f}".format)
total_spending_summary = total_spending.head()
total_spending_summary

              SN Total Purchase Value  Purchase Count Average Purchase Price
360    Lisosia93               $18.96               5                  $3.79
246  Idastidru52               $15.45               4                  $3.86
106   Chamjask73               $13.83               3                  $4.61
275       Iral74               $13.62               4                  $3.40
281  Iskadarya95               $13.10               3                  $4.37

In [913]:
Pop_Items = purchase_data.groupby(["Item Name", "Item ID", "Price"], as_index=False)["SN"].count()
Pop_Items.head()

                        Item Name  Item ID  Price  SN
0                   Abyssal Shard      162   2.67   5
1  Aetherius, Boon of the Blessed      137   3.39   5
2                          Agatha      120   3.08   6
3                           Alpha      130   2.07   3
4             Alpha, Oath of Zeal       79   4.05   3

In [914]:
Pop_Items_Total = purchase_data.groupby(["Item Name"], as_index=False)["Price"].sum()
Pop_Items_Total = Pop_Items_Total.rename(columns={"Price": "Total Purchase Value"})

Pop_Items_Total.head()

                        Item Name  Total Purchase Value
0                   Abyssal Shard                 13.35
1  Aetherius, Boon of the Blessed                 16.95
2                          Agatha                 18.48
3                           Alpha                  6.21
4             Alpha, Oath of Zeal                 12.15

In [915]:
Pop_Items_Summary = pd.merge(Pop_Items, Pop_Items_Total, on=["Item Name"], how="outer")
Pop_Items_Summary = Pop_Items_Summary.rename(columns={"SN": "Purchase Count"})
Pop_Items_Summary["Price"] = Pop_Items_Summary["Price"].map("${:.2f}".format)
Pop_Items_Summary.set_index(["Item ID"])
Pop_Items_Summary.head()

,Item Name,Item ID,Price,Purchase Count,Total Purchase Value
0,Abyssal Shard,162,$2.67,5,13.35
1,"Aetherius, Boon of the Blessed",137,$3.39,5,16.95
2,Agatha,120,$3.08,6,18.48
3,Alpha,130,$2.07,3,6.21
4,"Alpha, Oath of Zeal",79,$4.05,3,12.15

In [916]:
Most_Popular = Pop_Items_Summary.sort_values(["Purchase Count"], ascending=False)
Most_Popular["Total Purchase Value"] = Most_Popular["Total Purchase Value"].map("${:.2f}".format)
Most_Popular.set_index(["Item ID"], inplace=True)
Most_Popular.head()

,Item Name,Price,Purchase Count,Total Purchase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",$4.23,12,$50.76
108,"Extraction, Quickblade Of Trembling Hands",$3.53,9,$31.77
82,Nirvana,$4.90,9,$44.10
145,Fiery Glass Crusader,$4.58,9,$41.22
19,"Pursuit, Cudgel of Necromancy",$1.02,8,$8.16

In [917]:
Most_Profitable = Pop_Items_Summary.sort_values(["Total Purchase Value"], ascending=False)
Most_Profitable["Total Purchase Value"] = Most_Profitable["Total Purchase Value"].map("${:.2F}".format)
Most_Profitable.set_index(["Item ID"], inplace=True)
Most_Profitable.head()

,Item Name,Price,Purchase Count,Total Purchase Value
Item ID,,,,
92,Final Critic,$4.88,8,$59.99
101,Final Critic,$4.19,5,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",$4.23,12,$50.76
82,Nirvana,$4.90,9,$44.10
145,Fiery Glass Crusader,$4.58,9,$41.22